-- ----------
-- リスト入門
-- ----------

-- リストは"同じ型"の要素を格納できる
lostNumbers = [4, 8, 15, 16, 23, 42]
lostNumbers

-- 連結ができる
[1, 2, 3, 4] ++ [9, 10, 11, 12]

-- 文字列は文字のリスト
"hello" ++ " " ++ "world"
["w", "o"] ++ ["o", "t"] -- ダブルクォートだと文字列のリストが返る
['w', 'o'] ++ ['o', 't']

-- 大きい文字列の連結は注意

-- cons
-- 先頭に要素を付け加える
'A':" SMALL CAT"
5:[1, 2, 3, 4, 5]
5 : [1, 2, 3, 4, 5] -- コロンの前後に空白入れてもいける

'A' : [1, 2, 3, 4, 5] -- ERROR 型をそろえる

-- ++演算子はリストどうしでなければならない
[1, 2, 3, 4] ++ [5]
[1, 2, 3, 4] ++ 5 -- ERROR

-- シンタックス・シュガー
-- [1, 2, 3] は 1 : 2 : 3 : [] と同じ

-- 要素をとりだす
"Steve Buscemi" !! 6
[9.4, 33.2, 96.2, 11.2, 23.25] !! 1

-- リストのリスト
b = [[1, 2, 3, 4], [5, 3, 3, 3], [1, 2, 2, 3, 4], [1, 2, 3]]
b
b ++ [[1, 1, 1, 1]] -- リストのリストでないといけない
[6, 6, 6] : b
b !! 2

c = [[[1, 2, 3]]]
c ++ [[[4, 5, 6]]]
-- リストの比較
-- 一番最初に見つかる違う要素を比較
[3, 2, 1] > [2, 1, 0]
[3, 2, 1] > [2, 10, 100]
[3, 4, 2] < [3, 4, 3]
[3, 4, 2] > [2, 4]
[3, 4, -1] < [3, 4]
[3, 4, 2] == [3, 4, 2]

[3, 2, 1] > [4, 1, 0]
[3, 1, 1] == [3, 4, 2]

-- head
-- 先頭の要素を返す
head [5, 4, 3, 2, 1]

-- tail
-- 先頭以外の要素の"リスト"
tail [5, 4, 3, 2, 1]

-- last
-- 最後の要素
last [5, 4, 3, 2, 1]

-- init
-- 最後以外の要素の"リスト"
init [5, 4, 3, 2, 1]

-- 空のリストに対してはエラー
head []
tail []
last []
init []

-- lenght
length [5, 4, 3, 2, 1]
length [[1, 2, 3], [2, 3]]

-- null
-- 空リストかどうか
null [] -- True
null [1, 2, 3] -- False

-- reverse
reverse [5, 4, 3, 2, 1]

-- take
-- 先頭からn個の要素のリスト
take 3 [5, 4, 3, 2, 1]
take 1 [3, 9, 3]
take 5 [1, 2]
take 0 [6, 6, 6]

-- drop
-- 先頭からn個を削除した要素のリスト
drop 2 [8, 4, 2, 1, 5, 6]
drop 0 [1, 2, 3, 4]
drop 100 [1, 2, 3, 4]

-- maximum, minimum
maximum [1, 9, 2, 3, 4]
minimum [8 ,4, 2, 1, 5, 6]

-- sum
sum [5, 2, 1, 6, 3, 2, 5, 7]
product [6, 2, 1, 2]
product [1, 2, 5, 6, 7, 9, 2, 0]

-- elem
-- リストの要素に含まれているか，判定する
4 `elem` [3, 4, 5, 6]
10 `elem` [3, 4, 5, 6]

-- ----------
-- レンジでチン!
-- ----------

-- 1から20までを列挙する
[1..20]

-- 文字も
['a'..'z']
['K'..'Z']

-- 13の倍数の最初の23個
[13, 26..24*13]

-- 無限のリストを使う
take 24 [13, 26..]
take 24 [13, 2*13..]

[2, 4..63]
[20, 19..1]

-- 無限のリストを作る関数

-- cycle
take 10 (cycle [1, 2, 3])

-- repeat
take 10 (repeat 5)
take 10 (repeat [1, 2])

-- replicate
replicate 3 10
replicate 3 [1, 2]

-- 浮動小数は微妙
[0.1, 0.3..1.0]